#Задача 4
# Дан список, содержащий искажённые данные с должностями и именами сотрудников:
# ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА',
# 'токарь высшего разряда нИКОЛАй', 'директор аэлита']
# Известно, что имя сотрудника всегда в конце строки. Сформировать из этих имён и вывести на
# экран фразы вида: 'Привет, Игорь!' Подумать, как получить имена сотрудников из элементов
# списка, как привести их к корректному виду. Можно ли при этом не создавать новый список?
worker_list = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА',
             'токарь высшего разряда нИКОЛАй', 'директор аэлита']
for name in worker_list:
    worker_data = name.split()
    worker_name = worker_data[-1]
    worker_name = worker_name.lower()
    worker_name = worker_name.title()
    print('Добрый день, {}! Хорошего Вам дня.'.format(worker_name))
    # print('Добрый день,', worker_name,'!')